Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout_2 (Dropout)          (None, 1, 384)            0         
_________________________________________________________________
lstm_3 (LSTM)                (None, 128)               262656    
_________________________________________________________________
dense_5 (Dense)              (None, 50)                6450      
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 51        
=================================================================
Total params: 269,157
Trainable params: 269,157
Non-trainable params: 0
_________________________________________________________________
