Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed (TimeDistri (None, 4, 9, 64)          2112      
_________________________________________________________________
time_distributed_1 (TimeDist (None, 4, 6, 32)          8224      
_________________________________________________________________
time_distributed_2 (TimeDist (None, 4, 3, 32)          0         
_________________________________________________________________
time_distributed_3 (TimeDist (None, 4, 96)             0         
_________________________________________________________________
dropout (Dropout)            (None, 4, 96)             0         
_________________________________________________________________
lstm (LSTM)                  (None, 128)               115200    
_________________________________________________________________
dense (Dense)                (None, 50)                6450      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 51        
=================================================================
Total params: 132,037
Trainable params: 132,037
Non-trainable params: 0
_________________________________________________________________
